site/protected/components/Spicejet/production/SessionManager.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="SessionManager" targetNamespace="http://schemas.navitaire.com/WebServices" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:tns="http://schemas.navitaire.com/WebServices" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><wsp:Policy wsu:Id="BasicHttpBinding_ISessionManager_policy"><wsp:ExactlyOne><wsp:All><sp:TransportBinding xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy"><wsp:Policy><sp:TransportToken><wsp:Policy><sp:HttpsToken RequireClientCertificate="false"/></wsp:Policy></sp:TransportToken><sp:AlgorithmSuite><wsp:Policy><sp:Basic256/></wsp:Policy></sp:AlgorithmSuite><sp:Layout><wsp:Policy><sp:Strict/></wsp:Policy></sp:Layout></wsp:Policy></sp:TransportBinding></wsp:All></wsp:ExactlyOne></wsp:Policy><wsdl:types><xsd:schema targetNamespace="http://schemas.navitaire.com/WebServices/Imports"><xsd:import schemaLocation="https://sgr3xapi.navitaire.com/SessionManager.svc?xsd=xsd0" namespace="http://schemas.navitaire.com/WebServices/ServiceContracts/SessionService"/><xsd:import schemaLocation="https://sgr3xapi.navitaire.com/SessionManager.svc?xsd=xsd3" namespace="http://schemas.navitaire.com/WebServices"/><xsd:import schemaLocation="https://sgr3xapi.navitaire.com/SessionManager.svc?xsd=xsd1" namespace="http://schemas.microsoft.com/2003/10/Serialization/"/><xsd:import schemaLocation="https://sgr3xapi.navitaire.com/SessionManager.svc?xsd=xsd2" namespace="http://schemas.navitaire.com/WebServices/DataContracts/Session"/><xsd:import schemaLocation="https://sgr3xapi.navitaire.com/SessionManager.svc?xsd=xsd4" namespace="http://schemas.navitaire.com/WebServices/DataContracts/Common/Enumerations"/></xsd:schema></wsdl:types><wsdl:message name="ChangePasswordRequest"><wsdl:part name="parameters" element="q1:ChangePasswordRequest" xmlns:q1="http://schemas.navitaire.com/WebServices/ServiceContracts/SessionService"/></wsdl:message><wsdl:message name="ChangePasswordRequest_Headers"><wsdl:part name="ContractVersion" element="tns:ContractVersion"/></wsdl:message><wsdl:message name="ISessionManager_ChangePassword_OutputMessage"/><wsdl:message name="LogonRequest"><wsdl:part name="parameters" element="q2:LogonRequest" xmlns:q2="http://schemas.navitaire.com/WebServices/ServiceContracts/SessionService"/></wsdl:message><wsdl:message name="LogonRequest_Headers"><wsdl:part name="ContractVersion" element="tns:ContractVersion"/></wsdl:message><wsdl:message name="LogonResponse"><wsdl:part name="parameters" element="tns:LogonResponse"/></wsdl:message><wsdl:message name="LogoutRequest"><wsdl:part name="parameters" element="q3:LogoutRequest" xmlns:q3="http://schemas.navitaire.com/WebServices/ServiceContracts/SessionService"/></wsdl:message><wsdl:message name="LogoutRequest_Headers"><wsdl:part name="ContractVersion" element="tns:ContractVersion"/><wsdl:part name="Signature" element="tns:Signature"/></wsdl:message><wsdl:message name="ISessionManager_Logout_OutputMessage"/><wsdl:message name="TransferSessionRequest"><wsdl:part name="parameters" element="q4:TransferSessionRequest" xmlns:q4="http://schemas.navitaire.com/WebServices/ServiceContracts/SessionService"/></wsdl:message><wsdl:message name="TransferSessionRequest_Headers"><wsdl:part name="ContractVersion" element="tns:ContractVersion"/></wsdl:message><wsdl:message name="TransferSessionResponse"><wsdl:part name="parameters" element="q5:TransferSessionResponse" xmlns:q5="http://schemas.navitaire.com/WebServices/ServiceContracts/SessionService"/></wsdl:message><wsdl:message name="KeepAliveRequest"><wsdl:part name="parameters" element="q6:KeepAliveRequest" xmlns:q6="http://schemas.navitaire.com/WebServices/ServiceContracts/SessionService"/></wsdl:message><wsdl:message name="KeepAliveRequest_Headers"><wsdl:part name="ContractVersion" element="tns:ContractVersion"/><wsdl:part name="Signature" element="tns:Signature"/></wsdl:message><wsdl:message name="ISessionManager_KeepAlive_OutputMessage"/><wsdl:portType name="ISessionManager"><wsdl:operation name="ChangePassword"><wsdl:input wsaw:Action="http://schemas.navitaire.com/WebServices/ISessionManager/ChangePassword" name="ChangePasswordRequest" message="tns:ChangePasswordRequest"/><wsdl:output wsaw:Action="http://schemas.navitaire.com/WebServices/ISessionManager/ChangePasswordResponse" message="tns:ISessionManager_ChangePassword_OutputMessage"/></wsdl:operation><wsdl:operation name="Logon"><wsdl:input wsaw:Action="http://schemas.navitaire.com/WebServices/ISessionManager/Logon" name="LogonRequest" message="tns:LogonRequest"/><wsdl:output wsaw:Action="http://schemas.navitaire.com/WebServices/ISessionManager/LogonResponse" name="LogonResponse" message="tns:LogonResponse"/></wsdl:operation><wsdl:operation name="Logout"><wsdl:input wsaw:Action="http://schemas.navitaire.com/WebServices/ISessionManager/Logout" name="LogoutRequest" message="tns:LogoutRequest"/><wsdl:output wsaw:Action="http://schemas.navitaire.com/WebServices/ISessionManager/LogoutResponse" message="tns:ISessionManager_Logout_OutputMessage"/></wsdl:operation><wsdl:operation name="TransferSession"><wsdl:input wsaw:Action="http://schemas.navitaire.com/WebServices/ISessionManager/TransferSession" name="TransferSessionRequest" message="tns:TransferSessionRequest"/><wsdl:output wsaw:Action="http://schemas.navitaire.com/WebServices/ISessionManager/TransferSessionResponse" name="TransferSessionResponse" message="tns:TransferSessionResponse"/></wsdl:operation><wsdl:operation name="KeepAlive"><wsdl:input wsaw:Action="http://schemas.navitaire.com/WebServices/ISessionManager/KeepAlive" name="KeepAliveRequest" message="tns:KeepAliveRequest"/><wsdl:output wsaw:Action="http://schemas.navitaire.com/WebServices/ISessionManager/KeepAliveResponse" message="tns:ISessionManager_KeepAlive_OutputMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="BasicHttpBinding_ISessionManager" type="tns:ISessionManager"><wsp:PolicyReference URI="#BasicHttpBinding_ISessionManager_policy"/><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="ChangePassword"><soap:operation soapAction="http://schemas.navitaire.com/WebServices/ISessionManager/ChangePassword" style="document"/><wsdl:input name="ChangePasswordRequest"><soap:header message="tns:ChangePasswordRequest_Headers" part="ContractVersion" use="literal"/><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="Logon"><soap:operation soapAction="http://schemas.navitaire.com/WebServices/ISessionManager/Logon" style="document"/><wsdl:input name="LogonRequest"><soap:header message="tns:LogonRequest_Headers" part="ContractVersion" use="literal"/><soap:body use="literal"/></wsdl:input><wsdl:output name="LogonResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="Logout"><soap:operation soapAction="http://schemas.navitaire.com/WebServices/ISessionManager/Logout" style="document"/><wsdl:input name="LogoutRequest"><soap:header message="tns:LogoutRequest_Headers" part="ContractVersion" use="literal"/><soap:header message="tns:LogoutRequest_Headers" part="Signature" use="literal"/><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="TransferSession"><soap:operation soapAction="http://schemas.navitaire.com/WebServices/ISessionManager/TransferSession" style="document"/><wsdl:input name="TransferSessionRequest"><soap:header message="tns:TransferSessionRequest_Headers" part="ContractVersion" use="literal"/><soap:body use="literal"/></wsdl:input><wsdl:output name="TransferSessionResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="KeepAlive"><soap:operation soapAction="http://schemas.navitaire.com/WebServices/ISessionManager/KeepAlive" style="document"/><wsdl:input name="KeepAliveRequest"><soap:header message="tns:KeepAliveRequest_Headers" part="ContractVersion" use="literal"/><soap:header message="tns:KeepAliveRequest_Headers" part="Signature" use="literal"/><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="SessionManager"><wsdl:port name="BasicHttpBinding_ISessionManager" binding="tns:BasicHttpBinding_ISessionManager"><soap:address location="https://sgr3xapi.navitaire.com/SessionManager.svc"/></wsdl:port></wsdl:service></wsdl:definitions>